// 霸都丶傲天 2019年10月10日 https://github.com/AJLoveChina/birthday
var config = {
    // 句子的长度可以任意， 你可以写十句话， 二十句话都可以
    // 每句话尽量不要超过15个字,不然展示效果可能不太好
    texts: [
        "下面该我说了",      //这里,每句话结尾的最后一个逗号必须是英文的哦!! 很重要哦!!
        "主角是今天的寿星",  // 同上...
        "今天是你24岁。。。。",
        "额，说错了",
        "今天是你18岁的生日",
        "所以我要把我的祝福送给你",
        "愿你有少年的清澈与光芒",
        "心怀远方，仗剑天涯",
        "愿你所得皆所期，所失皆无碍",
        "所遇皆善良，所逢皆乐事",
        "愿你每一天都能奔走在自己的热爱里",
        "下雨有伞，天黑有灯",
        "还有好多好多。。。。",
        "希望这些祝福你都能收到",
        "凡是过往，皆为序章",
        "岁月漫长，未来可期",
        "许个愿望吧，祝你美梦成真",
        "明天。。也要好好的做自己哦！",
    ],
    /**
     * imgs 可以不填, 但是如果要填写的话必须遵循下面的格式
     * "对应上面的文字, 要完全一样" : "图片地址, 可以把图片放在imgs文件夹中"
     * 例如
     * "心爱的小可爱": "./imgs/xiaokeai.jpg"
     *
     * 如果不要图片的话, 直接在每行开头写两个斜杠注释即可, 例如下面的 "今天是你的生日" 的图片就不会展示了:)
     * Tip: 图片最好用正方形or接近正方形, 看起来效果更好
     */
    imgs: {
        "下面该我说了": "./imgs/6.jpg",
        "主角是今天的寿星": "./imgs/xiaokeai.png",
        "额，说错了": "./imgs/5.jpg",
        "今天是你18岁的生日": "./imgs/3.jpg",
        "所以我要把我的祝福送给你": "./imgs/4.jpg",
        "许个愿望吧，祝你美梦成真": "./imgs/2.jpg",
        // "今天是你的生日": "./imgs/birthday.jpg",
    },
    // 按钮文字描述, 以下是默认的按钮文字，英文的，您可以改成你喜欢的文字
    desc: {
        turn_on: "菜菜，点这个",
        play: "来点音乐",
        bannar_coming: "横幅拉上",
        balloons_flying: "来点特效",
        cake_fadein: "蛋糕？",
        light_candle: "蜡烛？",
        wish_message: "生日快乐",
        story: "接下来才是重点",
    }
};
